<?php
/*
  练习：使用循环打印出 0、1、2、3....9
*/
$i = 0;
while( $i<10 ){
	echo $i;
	$i++;
}

echo "<hr>";


/*
  练习：使用循环打印出 0、2、4、6、8....98
*/

/*
$i = 0;
while( $i<=98 ){
	echo $i;
	$i+=2;
}
*/

$i=0;
while( $i<=49 ){
	echo $i*2;
	$i++;
}

echo "<hr>";


/*
  练习：使用循环打印出 9、7、5、3、1
*/

$i=9;
while( $i>=1 ){
	echo $i;
	$i-=2;
}

echo "<hr>";



/*
  练习：使用循环打印出 1/99、 2/98、3/97、4/96.... 10/90
*/

/*
$i = 1;
$j = 99;
while( $i<=10 ){
	echo "$i/$j  &nbsp;&nbsp;";
	$i++;
	$j--;
}
*/
$i=1;
while( $i<=10 ){
	echo "$i/".(100-$i)."&nbsp;&nbsp;";
	$i++;
}