<?php
/*
练习：打印一个※
*/
echo "※";

echo "<hr>";


/*
练习：打印10个※
*/
$i = 0;
while( $i<10 ){
	echo "※";
	$i++;
}

echo "<hr>";

/*
练习：打印5行10列个※
*/
#思路1：连续打印50个※，当计数器能被10整除(如10/20/30..)输出一个<br>
$i = 0; 
while( $i<50 ){
	echo "※";
	$i++;

	if($i%10===0){		//计数器能被10整除
		echo "<br>";
	}
}
echo "<hr>";

#思路2：“打印10个※+<br>” —— 作为一个整体，再循环5次

$j = 0;
while( $j<5 ){
	#########################
	$i = 0;
	#打印10个※
	while($i<10){
		echo "※";
		$i++;
	}
	#外加一个<br>
	echo "<br>";
	##########################

	$j++;
}
echo "<hr>";

/*
输出
		※
		※※
		※※※
		※※※※
		※※※※※

*/
$j = 0;			//控制行
while( $j<5 ){
	
	$i=0;		//控制列
	#while( $i<10 ){
	while( $i<=$j ){
		echo "※";
		$i++;
	}
	echo "<br>";

	$j++;
}