<?php
/*
练习：创建一个变量保存员工的年龄，输出该员工是否适合于继续工作。年龄在18~65之间适合，否则不适合。
*/

$age = 30;
$result = $age>=18  &&  $age<=65;
echo "该员工适合继续工作吗：$result";


echo "<hr>";
/*
练习：创建一个变量表示年份，页面中输出这个年份是否为闰年。
注：闰年的判断公式满足下列两个条件之一即可  
(1)年份能被4整除，且不能被100整除的是闰年。
(2)年份能被400整除的是闰年
*/
$year = 2000;
$year = 3000;
$year = 2004;

$result = ( ($year%4===0)&&($year%100!==0) ) 
			|| 
		  ($year%400===0);

echo "$year 是闰年吗： $result";

echo "<hr>";
/*
创建一个变量表示用户输入的用户名，一个变量表示用户输入的密码，如果用户名为dingding，密码为123456，输出该用户可以成功登录吗：1
*/
$uname = 'dingding';
$upwd = '123';

$loginResult = $uname==='dingding' && $upwd==='123456';
echo "该用户可以成功登录吗：$loginResult";
?>