<?php
/*
1.输出一个※
*/
echo "※";

echo "<hr>";

/*
2.在一行输出10个※
*/
$i = 0;
while( $i<10 ){		#循环条件
	echo "※";		#循环体	 可能执行0~N
	$i++;
}
echo "<hr>";


$i = 0;
do {
	echo "※";		#循环体  可能执行1~N
	$i++;
}while( $i<10 );	#循环条件
echo "<hr>";


/*
3.输出5行10列个※ —— 循环的嵌套：执行5次“一行10列”
*/
#while实现
$i = 0;  //行数
while( $i<5 ){
	#输出10个※
	$j = 0;		//列数
	while( $j<10 ){
		echo "※";
		$j++;
	}
	#输出1个换行
	echo "<br>";

	$i++;
}
echo "<hr>";

#do..while实现

$i = 0;		//行数
do {
	#输出一行※
	$j = 0;
	do{
		echo "※";
		$j++;
	}while($j<10);
	#输出一个<br>
	echo "<br>";
	#计数器$i自增
	$i++;
}while( $i<5 );

echo "<hr>";



/*
4.输出※组成的三角形
※
※※
※※※
※※※※
※※※※※
*/
#$i控制行数  $j控制列数  N行中有N个※

$i = 1;		//行数
while( $i<=5 ){
	#输出一行的※
	$j = 1;	//列数
	//while($j<=10){			
	while($j<=$i){
		echo "※";
		$j++;
	}
	#输出一个<br>
	echo "<br>";
	#计数器$i自加
	$i++;
}
echo "<hr>";
/*
5.输出九九乘法表 =>  三角形
※
※※
※※※
※※※※
※※※※※
*/
$i = 1;  //行数
while( $i<=9 ){
	//输出一行内容
	$j = 1;  //列数
	while($j<=$i){
		echo $i.'*'.$j.'='.($i*$j).'&nbsp;&nbsp;';
		$j++;
	}
	//输出一个<br>
	echo "<br>";
	//计数器$i自加
	$i++;
}