<?php
/*
练习：从2000年开始，打印出10个闰年	 —— 有一定难度

循环：$i: 2000、2001、2002、2003....结束点未知 => 死循环

思路：(1)能被4整除但不能被100整除  (2)能被400整除
	
计数器：$count=0; 已经输出的闰年的个数；到了10的时候就退出死循环（break）
*/
$count = 0;  //已经打印出来的闰年的个数
for($i=2000;   ; $i++){
	//$i形如：2000/2001/2002.....
	#判定$i当前值是否为闰年
	if( (($i%4===0)&&($i%100!==0))||($i%400===0) ){	
		echo "$i &nbsp;&nbsp;";	//$i是闰年
		$count++;  //又输出了一个闰年
		if($count===10){
			break;  //退出死循环
		}
	}
}

/*
$count = 0;  //已经打印出来的闰年的个数
for($i=2000;  $count<10 ; $i++){
	//$i形如：2000/2001/2002.....
	#判定$i当前值是否为闰年
	if( (($i%4===0)&&($i%100!==0))||($i%400===0) ){	
		echo "$i &nbsp;&nbsp;";	//$i是闰年
		$count++;
	}
}
*/